# Concatenación de datos

In [1]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt

In [2]:
datasets_dir = r'..\..\python-ml-course-master\datasets'

In [4]:
red_wine = pd.read_csv(datasets_dir + os.sep + r'wine\winequality-red.csv', sep=';')
red_wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [5]:
red_wine.columns.values

array(['fixed acidity', 'volatile acidity', 'citric acid',
       'residual sugar', 'chlorides', 'free sulfur dioxide',
       'total sulfur dioxide', 'density', 'pH', 'sulphates', 'alcohol',
       'quality'], dtype=object)

In [6]:
red_wine.shape

(1599, 12)

In [7]:
white_wine = pd.read_csv(datasets_dir + os.sep + r'wine\winequality-white.csv', sep=';')
white_wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.0,0.27,0.36,20.7,0.045,45.0,170.0,1.0010,3.00,0.45,8.8,6
1,6.3,0.30,0.34,1.6,0.049,14.0,132.0,0.9940,3.30,0.49,9.5,6
2,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.9951,3.26,0.44,10.1,6
3,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6
4,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6

In [8]:
white_wine.shape

(4898, 12)

In [9]:
wine_data = pd.concat([red_wine, white_wine], axis=0)
wine_data.shape

(6497, 12)

## Datos distribuidos

In [10]:
filepath = datasets_dir + os.sep + r'distributed-data\001.csv'
data = pd.read_csv(filepath)
data.head() 
# Es una matriz del tipos sparsed, es decir contiene muchos valores sin dato. 
# Tienden a no ser almacenados en memoria, por lo que aligera

         Date  sulfate  nitrate  ID
0  2003-01-01      NaN      NaN   1
1  2003-01-02      NaN      NaN   1
2  2003-01-03      NaN      NaN   1
3  2003-01-04      NaN      NaN   1
4  2003-01-05      NaN      NaN   1

In [13]:
file_dir = datasets_dir + os.sep + r'distributed-data'
for r, d, f in os.walk(file_dir):
    for file in f:
        if file.endswith(".csv"):
            path = file_dir + os.sep + file            
            data2 = pd.read_csv(path)
            data = pd.concat([data, data2], axis=0)

In [14]:
data.shape

(1545635, 4)

## JOINS

In [15]:
filepath = datasets_dir + os.sep +  r"athletes\Medals.csv"

In [16]:
data = pd.read_csv(filepath, encoding="ISO-8859-1")  # lo normal es UTF-8, la ISO es porque habrá algún nombre de otro país
data.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [17]:
a = data["Athlete"].unique().tolist() # Los atletas
len(a)

6956

In [18]:
filepath = datasets_dir + os.sep + r"athletes\Athelete_Country_Map.csv"
data_country = pd.read_csv(filepath, encoding="ISO-8859-1")
data_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [19]:
len(data_country) 
# la diferencia se puede deber a que haya atletas que hayan participado 
# con paises distintos o que hayan cambiado de nombre

6970

In [20]:
filepath = datasets_dir + os.sep + r"athletes\Athelete_Sports_Map.csv"
data_sport = pd.read_csv(filepath, encoding="ISO-8859-1")
data_sport.head()

            Athlete       Sport
0    Michael Phelps    Swimming
1  Natalie Coughlin    Swimming
2     Aleksey Nemov  Gymnastics
3     Alicia Coutts    Swimming
4    Missy Franklin    Swimming

In [21]:
len(data_sport)

6975

In [22]:
data_sport[(data_sport["Athlete"]=="Chen Jing") | 
           (data_sport["Athlete"]=="Richard Thompson") | 
           (data_sport["Athlete"]=="Matt Ryan")]

               Athlete         Sport
528   Richard Thompson     Athletics
1308         Chen Jing    Volleyball
1419         Chen Jing  Table Tennis
2727         Matt Ryan        Rowing
5003         Matt Ryan    Equestrian
5691  Richard Thompson      Baseball

In [40]:
data_country_dp = data_country.drop_duplicates(subset="Athlete") 
len(data_country_dp)# Eliminamos duplicados por el nombre. Lo correcto sería cotejar que medallas se ganaron con que pais

6956

In [41]:
data_main_country = pd.merge(left=data, right=data_country_dp, 
                            left_on="Athlete", right_on="Athlete")
data_main_country.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States

In [42]:
data_main_country.shape # Salen mas que athletas porque hay deportistas que han jugado con varios paises.
                        # Hay una relación de 1-M al hacer el innerjoin

(8618, 9)

In [43]:
data_sports_dp = data_sport.drop_duplicates(subset="Athlete")

In [44]:
data_final = pd.merge(left=data_main_country, right=data_sport_dp, 
                            left_on="Athlete", right_on="Athlete")
data_final.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States,Swimming
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States,Swimming
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States,Swimming
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States,Swimming
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States,Swimming

In [45]:
data_final.shape

(8618, 10)

## Tipos de JOIN

In [53]:
from IPython.display import Image

In [54]:
out_athletes = np.random.choice(data["Athlete"], size=6, replace=False)

In [55]:
# dp son sin duplicados
# Con estas tres lineas tenemos ya una serie de dataset a los que le faltan líneas para proceder a los joins
data_country_dlt = data_country_dp[(~data_country_dp["Athlete"].isin(out_athletes)) & 
                                   (data_country_dp["Athlete"] != "Michael Phelps")]

data_sports_dlt = data_sports_dp[(~data_sports_dp["Athlete"].isin(out_athletes)) & 
                                   (data_sports_dp["Athlete"] != "Michael Phelps")]

data_main_dlt = data[(~data["Athlete"].isin(out_athletes)) & 
                                   (data["Athlete"] != "Michael Phelps")]

In [56]:
data_country_dlt.shape

(6949, 2)

### Inner Join

In [65]:
# data main contiene toda la información 
# data_country_dlt le falta la información de 7 atletas.
merged_inner = pd.merge(left=data, right=data_country_dlt, how="inner", left_on="Athlete", right_on="Athlete")
merged_inner.shape

(8607, 9)

In [66]:
merged_inner.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
1,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States
2,Natalie Coughlin,29.0,2012,08/12/2012,0,0,1,1,United States
3,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6,Russia
4,Alicia Coutts,24.0,2012,08/12/2012,1,3,1,5,Australia

### Left Join

In [82]:
merged_left = pd.merge(left=data, right=data_country_dlt, how="left", left_on="Athlete", right_on="Athlete")
merged_left.shape

(8618, 9)

In [83]:
merged_left.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,NaN
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,NaN
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,NaN
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6,Russia

### Right Join

In [84]:
merged_right = pd.merge(left=data_main_dlt, right=data_country_dp, how="right", left_on="Athlete", right_on="Athlete")
merged_right.shape

(8614, 9)

In [85]:
merged_right.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Natalie Coughlin,25.0,2008.0,08/24/2008,1.0,2.0,3.0,6.0,United States
1,Natalie Coughlin,21.0,2004.0,08/29/2004,2.0,2.0,1.0,5.0,United States
2,Natalie Coughlin,29.0,2012.0,08/12/2012,0.0,0.0,1.0,1.0,United States
3,Aleksey Nemov,24.0,2000.0,10/01/2000,2.0,1.0,3.0,6.0,Russia
4,Alicia Coutts,24.0,2012.0,08/12/2012,1.0,3.0,1.0,5.0,Australia

### Outer Join

In [88]:
data_country_mmm = data_country_dlt.append({
    "Athlete":"MMM",
    "Country":"Aquinostan"
}, ignore_index=True)

In [89]:
merged_outer = pd.merge(left=data, right=data_country_mmm, how="outer", left_on="Athlete", right_on="Athlete")
merged_outer.shape

(8619, 9)

In [91]:
merged_outer.head(10)

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008.0,08/24/2008,8.0,0.0,0.0,8.0,NaN
1,Michael Phelps,19.0,2004.0,08/29/2004,6.0,0.0,2.0,8.0,NaN
2,Michael Phelps,27.0,2012.0,08/12/2012,4.0,2.0,0.0,6.0,NaN
3,Natalie Coughlin,25.0,2008.0,08/24/2008,1.0,2.0,3.0,6.0,United States
4,Natalie Coughlin,21.0,2004.0,08/29/2004,2.0,2.0,1.0,5.0,United States
5,Natalie Coughlin,29.0,2012.0,08/12/2012,0.0,0.0,1.0,1.0,United States
6,Aleksey Nemov,24.0,2000.0,10/01/2000,2.0,1.0,3.0,6.0,Russia
7,Alicia Coutts,24.0,2012.0,08/12/2012,1.0,3.0,1.0,5.0,Australia
8,Missy Franklin,17.0,2012.0,08/12/2012,4.0,0.0,1.0,5.0,United States
9,Ryan Lochte,27.0,2012.0,08/12/2012,2.0,2.0,1.0,5.0,United States